Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བཀས་སྤྲོ་བ་མཛད་དོ། །ཡང་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་སོགས་པ་གང་དག་བཟོད་པ་ཐོབ་པ་བྱེ་བ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་བདུན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ན་གནས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས།
en: In response, all of the ninety-seven tens of thousands of millions of bodhisattva great beings who dwell in this buddha field and have attained acceptance, led by Maitreya, spoke with a single voice:

source: བདག་ཅག་གིས་ཀྱང་དུས་གསུམ་དུ་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་པའི་སླད་དུ། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རིགས་པས་སྟོན་པར་བཀུར་ཞིང་། གུས་པ་ཆེན་པོས་བཟུང་བར་བགྱིའོ།
en: “We also, following the instructions of all the buddhas, accept, as is proper, our responsibility with regard to this Dharma discourse that has been commended by our supreme guides, as the way to worship the thus-gone ones of the three times and out of respect for our teachers.

source: །སྙིང་རྗེས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བ་ནས།
en: Acting out of compassion we will, in order to bring beings to maturity . . .

source: བླ་ན་མེད་པའི་ལམ་གྱི་བར་ལ་དགོད་པའི་སླད་དུ་བདག་ཅག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། ཕོ་བྲང་འཁོར་དང་། དགོན་པའི་གནས་རྣམས་སུ་རྒྱས་པར་བསྟན་པར་བགྱིའོ།
en: and to establish them on the unsurpassable path, glorify this Dharma discourse far and wide—in villages, towns, cities, countries, state capitals, and inhabited forests.

source: །དམ་པའི་ཆོས་ཡུན་རིང་དུ་གནས་པར་བགྱི་བའི་སླད་དུ། སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་སྨིན་པར་བགྱིའོ།
en: We will bring beings to full maturity so that the sacred Dharma continues for a long time.”

source: །ཡང་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་གཏོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱིས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: All the blessed buddhas in this buddha field applauded, saying, “Good!

source: སྐྱེས་བུ་དམ་པ་དག་ལེགས་སོ་ལེགས་སོ།
en: Good it is, O good people, that you will do this!”

source: །ཁྱོད་ཀྱིས་དེ་བཞིན་དུ་གྱིས་ཤིག །དེ་ནས་བརྒྱ་བྱིན་དང་། ཚངས་པ་ནས་ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོའི་བར་ཐམས་ཅད་དང་། གང་དག་གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་འདུས་པ། སེམས་ཅན་གཟི་བརྗིད་ཆེ་བ། གཟི་བརྗིད་ཆེ་བ། བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་དེ་དག་ཐམས་ཅད་ཀྱིས་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བདག་ཅག་གིས་ཀྱང་དམ་པའི་ཆོས་ཡུན་རིང་དུ་གནས་པར་བགྱི་བའི་སླད་དུ་འདུས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཟུང་བར་བགྱི་བ་ནས་རྒྱས་པར་རབ་ཏུ་བཤད་པའི་བར་དུ་བགྱིའོ།
en: And the lords of śakras, brahmās, mahoragas, and other beings who were in this buddha field—sixty-four million billion beings of great splendor and majesty—all said with one voice, “To ensure that the sacred Dharma continues for a long time, we will also uphold, . . .

source: །ཡང་དག་པར་བསྟན་པར་བགྱིའོ།
en: teach in full, and glorify this Dharma discourse—the Great Collection dhāraṇī.

source: །སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིའོ།
en: We will bring beings to full maturity.

source: །ཆོས་འཚལ་བ་དང་། ཆོས་མཉན་པའི་གང་ཟག་རྣམས་ཀྱང་བསྲུང་བར་བགྱིའོ།
en: We will protect and take care of the Dharma students who uphold the sacred Dharma.

source: །ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ། །གང་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤྱོད་པར་འགྱུར་བ་དེར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི་བཀས་བདག་ཅག་གིས་ཀྱང་འཐབ་པ་དང་། རྩོད་པ་དང་། འཐབ་མོ་དང་། འགྱེད་པ་དང་། མུ་གེ་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། དུས་མ་ཡིན་པའི་རླུང་དང་། ཆར་པ་དང་། གྲང་བ་དང་། ཚ་བ་དང་། གདུག་པ་དང་། རྩུབ་པ་དང་། རོ་མ་མཆིས་པ་དང་། སྲ་བ་དང་། ཁ་བ་དང་། ཚ་བའི་དངོས་པོ་རྣམས་རབ་ཏུ་ཞི་བར་བགྱིའོ།
en: Wherever this Dharma discourse is practiced, there we will, following the instructions of all the buddhas, pacify all discord, quarrels, wars, famine, disease, invasions by foreign powers, unseasonable cold and hot spells, storms, torrential rains, hurricanes, and anything that tastes foul, unpleasant, sour, bitter, or is tasteless.

source: །བདེ་བ་དང་། ཉམས་དགའ་བ་དང་། ལོ་ལེགས་པ་དང་། འདུམ་པ་བསྒྲུབ་པར་བགྱིའོ།
en: We will bring about every type of comfort and pleasure and ensure there is an abundance of provisions of every kind.

source: །ཆོས་ཀྱི་ཚུལ་ཡུན་རིང་དུ་གནས་པར་བགྱི་བའི་སླད་དུ་ནན་ཏན་ཆེར་བགྱིའོ།
en: We will make every effort to ensure that the methods of the sacred Dharma continue for a long time.

source: །ཆོས་ཉན་པའི་རྒྱལ་པོ་དེ་དག་ཀྱང་ཤིན་ཏུ་ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ། །བསམ་གཏན་ལ་མངོན་པར་དགའ་བའི་སེམས་ཅན་རྣམས་ཀྱང་བསྲུང་བར་བགྱིའོ།
en: Furthermore, we will protect righteous kings and take care of those who delight in meditation.”

source: །དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱིས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: All the blessed buddhas applauded them, saying, “Good!

source: བཞིན་བཟངས་དག་ལེགས་སོ་ལེགས་སོ།
en: Good it is, O good people, that you will do this!

source: །ཁྱེད་ཀྱིས་དེ་བཞིན་དུ་གྱིས་ཤིག །བདག་དང་གཞན་དང་གཉི་གའི་ཕྱིར་ནན་ཏན་གྱིས་ཤིག །དེ་ལྟར་ན་ཁྱེད་ཀྱིས་དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ལ་མཆོད་པ་བྱས་པར་འགྱུར་རོ།
en: You should exert yourselves for the sake of yourselves as well as others. In this way you will venerate the blessed buddhas of the three times.

source: །འདི་ལྟར་ཁྱེད་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། དམ་པའི་ཆོས་ཀྱི་ཚུལ་འབར་བར་དང་། དམ་པའི་ཆོས་ཡུན་རིང་དུ་གནས་པར་བྱ་བའི་ཕྱིར་བརྩོན་ན་ཁྱེད་རིང་པོར་མི་ཐོགས་པར་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: If you make an effort to bring beings to maturity, to glorify this Dharma method, and to make the sacred Dharma continue for a long time, you will swiftly awaken fully and completely to unsurpassed and perfect buddhahood.”

source: །དེ་ནས་དབུས་ཀྱི་གླིང་བཞི་པ་འདི་ན་གནས་པའི་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། ལྷའི་དབང་པོ་ནས་ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོའི་བར་དང་། གང་དག་ཡང་སེམས་ཅན་གཟི་བརྗིད་ཆེ་བ་གཟི་བརྗིད་ཆེ་བ་དེ་དག་ཐམས་ཅད་སྟན་ལས་ལངས་ཏེ་ཐལ་མོ་སྦྱར་ནས་འདུས་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི་བཀས་བདག་ཅག་གིས་ཀྱང་། ཆོས་ཀྱི་ཚུལ་འདི་བསྟན་པར་བགྱི། བསྲུང་བར་བགྱི། ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ།
en: Now all the lords of śakras, brahmās, gods, and mahoragas who live in the central universe consisting of the four continents—all of them of great splendor—rose from their seats and, standing with folded hands, said, “We, too, following the instructions of all the blessed buddhas, will protect this Dharma method and glorify it.

source: །འདུས་པ་ཆེན་པོ་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་གཟུངས་ཀྱི་ཕྱག་རྒྱའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་རིགས་པས་བླང་བར་བགྱི་བ་ནས།
en: We accept, as is proper, our responsibility with regard to this Great Collection sūtra that has been blessed by all the buddhas—this dhāraṇī-seal—this Dharma discourse . . .

source: གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་དང་། ཕོ་བྲང་འཁོར་དང་། དགོན་པའི་གནས་རྣམས་སུ་རྒྱས་པར་བཤད་པར་བགྱིའོ།
en: and will teach it in full in villages, towns, cities, countries, state capitals, and inhabited forests.

source: །དམ་པའི་ཆོས་འཛིན་པའི་གང་ཟག་རྣམས་ཀྱང་བསྲུང་བར་བགྱིའོ། །ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ།
en: We will care for and protect those who uphold the sacred Dharma.

source: །གང་དག་ཡང་ཆོས་བསྲུང་བར་གནས་པའམ། ཆོས་སྨྲ་བའམ། ཆོས་ཉན་པའི་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དང་། དད་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་རྣམས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་ནས་གླེགས་བམ་ལ་བྲིས་ཏེ།
en: As for those who are established in the practice of the Dharma—Dharma teachers and students, monks and nuns, male and female lay practitioners, and other noble sons and daughters who have faith, delight in meditation, uphold this Dharma discourse, . . .

source: འཆང་བའི་བར་དུ་བགྱིད་པ་དང་། བསམ་གཏན་ལ་བརྩོན་པ་དེ་དག་བདག་ཅག་གིས་བསྲུང་བར་བགྱི། ཡོངས་སུ་བསྐྱང་བར་བགྱི། སྟང་དུ་བགྱི། བླ་མར་བགྱི། རི་མོར་བགྱི།
en: or write it down and preserve it in the form of a book—we will protect, care for, respect, revere, honor, and worship all of them.

source: མཆོད་པར་བགྱི། གོས་དང་། གདུགས་དང་། བ་དན་དང་། རྒྱལ་མཚན་དང་། བྱུག་པ་ནས་སྨན་དང་། ཡོ་བྱད་ཐམས་ཅད་ཀྱི་བར་གྱིས་བསྟི་སྟང་དུ་བགྱིའོ།
en: We will respectfully present them with robes, parasols, banners, flags, scented oils, . . . and all kinds of medicines and utensils.

source: །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆང་བའམ། ཀློག་པའམ། སྟོན་པའི་དྲུང་དུ་བདག་ཅག་ཉིད་ཉན་པའི་སླད་དུ་ཉེ་བར་མཆི་བར་བགྱིའོ།
en: “And while this Dharma discourse is being taught and elucidated, we will attend to it to hear it for ourselves.

source: །བདག་ཅག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་སྟོན་པར་འདུ་ཤེས་པས། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གྱིས་བསྟི་སྟང་དུ་བགྱི། བླ་མར་བགྱི། རི་མོར་བགྱི། མཆོད་པར་བགྱིའོ།
en: Recognizing it as the supreme teacher, we will respect, revere, honor, and worship this Dharma discourse with parasols, banners, and flags.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is this?

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་གཟུངས་ཀྱི་ཕྱག་རྒྱའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆད་པའི་ཚེ། ཆོས་ཀྱི་བཅུད་ཀྱིས་བདག་ཅག་མདངས་དང་ལྡན་པར་འགྱུར། སྟོབས་དང་ལྡན། བརྩོན་འགྲུས་དང་ལྡན།
en: It is because while this Dharma discourse on the dhāraṇī-seal that has been blessed by all the buddhas is being taught, we will be energized by the elixir of the Dharma.

source: མཐུ་དང་ལྡན།
en: Strong, diligent, mindful, and surrounded by supporters, we will become an invincible army.

source: དྲན་པ་དང་ལྡན། ཡེ་ཤེས་དང་ལྡན། ཕྱོགས་དང་གཡོག་ཏུ་ལྡན་ཞིང་། ཆོས་དང་མཐུ་ཐོགས་པ་མ་མཆིས་པར་འགྱུར་རོ། །དེ་ལྟར་བདག་ཅག་གིས་ཡུལ་ཐམས་ཅད་དུ་འཐབ་པ་དང་། རྩོད་པ་དང་། འཐབ་མོ་དང་། འགྱེད་པ་དང་། མུ་གེ་དང་། ནད་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། དུས་མ་ལགས་པའི་རླུང་དང་། ཆར་དང་། གྲང་བ་དང་། ཚ་བ་དང་། ཆར་མི་འབབ་པ་དང་། རྨི་ལམ་ངན་པ་དང་། ལྟས་ངན་པ་དང་། སྡང་བ་དང་། རྩུབ་པ་དང་། བརླང་བ་དང་། ཁ་བ་དང་། ཚ་བ་དང་། རོ་མ་མཆིས་པ་དང་། མི་དགེ་བའི་ཕྱོགས་བགྱིད་པའི་དངོས་པོ་རྣམས་རབ་ཏུ་ཞི་བར་བགྱིའོ།
en: In this way, we will quell, in every realm, all discord, quarrels, wars, disputes, famine, disease, invasions by foreign powers, unseasonable storms, torrential rains, cold and hot spells, droughts, bad dreams, and bad omens; all the foul, unpleasant, sour, bitter, acerbic, or insipid tastes;

source: །ཤིན་ཏུ་བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། ཉམས་དགའ་བ་དང་། ནད་མ་མཆིས་པ་དང་། འདུམ་པ་བསྒྲུབ་པར་བགྱིའོ།
en: and all immoral predilections. “Moreover, we will provide for every possible comfort, the abundance of provisions and food, enjoyments, and freedom from disease.

source: །རླུང་དང་། ཆར་དང་། གྲང་བ་དང་། ཚ་བ་རྣམས་དུས་གསུམ་དུ་འབྱུང་བར་བགྱིའོ། །མཚན་མོ་དང་། ཉིན་མོ་དང་། ཟླ་བ་དང་། ཟླ་བ་ཕྱེད་པ་དང་། ལོ་དང་། དུས་རྣམས་ཀྱང་ལེགས་པར་འབྱུང་བར་བགྱིའོ། །གཟའ་དང་། རྒྱུ་སྐར་དང་། ཉི་མ་དང་། ཟླ་བ་རྣམས་ཀྱང་ལེགས་པར་རྒྱུ་བར་བགྱིའོ།
en: We will set in motion timely winds, rains, cool and hot weather, and an abundance of water. We will set in motion auspicious constellations, nights, days, months, fortnights, seasons, and years.

source: །འབབ་ཆུ་དང་། ཆུ་མིག་དང་། རྫིང་དང་། ལྟེང་ཀ་ཡང་ཤིན་ཏུ་བལྟམ་པར་བགྱིའོ། །གང་དུ་སེམས་ཅན་རྣམས་ཆུའི་ཀླུང་གིས་གནོད་པར་གྱུར་པ་ཡང་བདག་ཅག་གིས་བསལ་བར་བགྱིའོ།
en: We will fill the rivers, lakes, ponds, and lotus ponds. In places where beings are troubled by floods, we will stop this calamity.

source: །གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དེ་དག་ཏུ་ཡང་སེམས་ཅན་ལ་སྨན་པར་བགྱི་བའི་སླད་དུ། བདག་ཅག་གིས་འདབ་མ་དང་། ཡལ་ག་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དང་། སྡོང་བུ་དང་། འབྲུ་དང་། སྨན་དང་། རོ་དང་། ལོ་ཏོག་རྣམས་ཤིན་ཏུ་སྣུམ་པ་དང་། བདའ་བ་དང་། ཁ་དོག་དང་། རོ་ཆེ་ཞིང་མང་བ་བསྒྲུབ་པར་བགྱིའོ།
en: Furthermore, in such places of trouble—villages, towns, cities, and countries—we will procure for the benefit of beings leaves, branches, flowers, fruits, bulbs, grain, herbs, and other crops —all of them plentiful, of prime quality and pleasant appearance, juicy, succulent, and tasty.

source: །སེམས་ཅན་རྣམས་ལ་ནོར་དང་། འབྲུ་དང་། སྨན་དང་། གོས་དང་། ལྷབ་ལྷུབ་ཀྱིས་མི་བྲེལ་བར་བསྒྲུབ་པར་བགྱིའོ།
en: We will also provision beings with wealth, crops, medicines, clothing, and ornaments, without leaving anything lacking.

source: །སེམས་ཅན་དེ་དག་ཀྱང་དགེ་བ་ཚོལ་བའི་སེམས་དང་། སྡིག་པ་ཡོངས་སུ་སྤོང་བ་དང་། དཔལ་དང་། བསོད་ནམས་འབྱུང་བས་ཚེ་རིང་པོ་འགྲུབ་པར་བགྱིའོ། །གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། ཕོ་བྲང་འཁོར་གང་དག་ཏུ་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་གཟུངས་ཀྱི་ཕྱག་རྒྱའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆང་ངམ། ཐ་ན་གླེགས་བམ་ལ་བྲིས་ཏེ། འཆང་ངམ། ཀློག་གམ། མཆོད་དམ།
en: “We will ensure the longevity that arises from glory and merit for those beings who engage in wholesome pursuits and will spurn evil ones. In the houses, towns, cities, countries, or capital cities where this Dharma discourse on dhāraṇī-seals, blessed by all the buddhas, is taught in its entirety, written down and preserved in book form, recited, worshiped, and treated with respect, any head-anointed kṣatriya kings who are living in these places will be protected and cared for by us.

source: བསྟི་སྟང་བགྱིད་ཅིང་། འཆང་བ་དེ་དག་ཏུ་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་འབྱུང་བ་དེ་དག་ཀྱང་།
en: We will dispel anything that is harmful to them, and we will procure for them anything that is salutary.

source: བདག་ཅག་གིས་བསྲུང་བར་བགྱི། ཡོངས་སུ་བསྐྱང་བར་བགྱི། དེ་དག་ལ་གནོད་པ་བསལ་བར་བགྱི། ཕན་པ་བསྒྲུབ་པར་བགྱིའོ། །ལྟད་མོ་དང་། བཀྲ་མི་ཤིས་པ་དང་། ལྟ་བ་ངན་པ་དང་། བྱེད་པ་ངན་པ་དང་། བྱིན་རླབས་ངན་པ་དང་། སྨོན་ལམ་ངན་པ་དང་། སྐྱབས་ངན་པ་དང་། ཚུལ་འཆོས་པ་དང་། ཁ་གསག་དང་། གཡོ་དང་། སྒྱུ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲག་དོག་དང་། ཁྲོ་བ་དང་། སེར་སྣ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིའོ།
en: We will quell all idle curiosity, inauspiciousness, wrong views, wrong actions, wrong authority, wrong aspirations, wrong refuge, hypocrisy, garrulousness, treachery, deceit, lies, envy, anger, and resentment.

source: །ཡང་དག་པའི་ལྟ་བའི་ལམ་དྲང་པོ་དང་། དད་པ་དང་། དུལ་བ་དང་། ཀུན་སྡོམ་པ་དང་། ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པ་ལ་གཟུད་པར་བགྱིའོ།
en: We will establish them on the straight path of correct views and inspire them to adhere to faith, self-control, self-restraint, conscientiousness, and decorum.

source: །དེ་བཞིན་དུ་བཙུན་མོ་དམ་པ་རྣམས་དང་། བཙུན་མོའི་འཁོར་རྣམས་དང་། བློན་པོ་དང་། རྩིས་པ་ཆེན་པོ་དང་། གྲོང་རྡལ་པ་ང་། ཞོ་ཤས་འཚོ་བ་དང་། ལྗོངས་ཀྱི་མི་རྣམས་དང་། རིགས་བཞི་རྣམས་དང་། བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་རྣམས་ཀྱང་བསྲུང་ཞིང་བསྐྱང་བར་བགྱི་བ་ནས་ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པའི་བར་ལ་གཟུད་པར་བགྱིའོ།
en: “In the same way, we will protect, care for, . . . and inspire conscientiousness and decorum in the chief queens, concubines, ministers, and accountants, in the prominent people in the towns and the country, in the four castes, and in women, men, sons, and daughters.

source: །ཐ་ན་ཡུལ་དེ་དག་ཏུ་རྐང་བཞི་པ་རྣམས་ཀྱང་བསྲུང་བར་བགྱིའོ།
en: We will also, in the same places, give complete protection to all the animals.

source: །གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆད་པར་འགྱུར་བ་ནས་གླེགས་བམ་ལ་བྲིས་ཏེ། བཞག་པའི་བར་དུ་བགྱིད་ན།
en: Wherever this Dharma discourse is explained . . . and written down and preserved in the form of a book, we will thus care for the beings there with great effort and courage.

source: སེམས་ཅན་དེ་དག་ལ་བདག་ཅག་གིས་དེ་འདྲ་བའི་ནན་ཏན་ཆེན་པོ་དང་རྟུལ་བ་ཆེན་པོས་ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ། །ཆོས་ཀྱི་ཚུལ་ཡང་དག་པར་བསྟན་པའི་སླད་དུ།
en: We will strive to glorify this Dharma method and stop it from disappearing.”

source: བསྐལ་པ་མཐའ་ཡས་པར་ནན་ཏན་ཆེར་བགྱིའོ། །དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱིས་སྐྱེས་བུ་དམ་པ་དེ་དག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: All the blessed buddhas applauded these sublime beings, saying, “Good!

source: བཞིན་བཟངས་དག་ལེགས་སོ་ལེགས་སོ། །ཁྱེད་ཀྱིས་དེ་བཞིན་དུ་གྱིས་ཤིག །ཁྱེད་ཀྱིས་ཆོས་ཀྱི་ཚུལ་དང་། དཀོན་མཆོག་གསུམ་གྱི་རིགས་མི་ནུབ་པར་ནན་ཏན་བྱས་ན།
en: Good it is, sublime beings, that you will do that, and that you will strive to prevent this Dharma method and the lineage of the Three Jewels from disappearing.

source: དེ་ལྟ་ན་ཁྱེད་ཀྱིས་དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ལ་མཆོད་པ་བྱས་པར་འགྱུར་རོ། །འདུས་པ་ཆེན་པོ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་ལས།
en: In this way you will worship the blessed buddhas of the three times.”

source: ཀུན་ཏུ་བསྲུང་བའི་ལེའུ་སྟེ། བཅུ་པའོ།།
en: This concludes the tenth chapter of the “ Ratnaketu Sūtra ,” about protection.

source: །།དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཕགས་སྐྱེས་པོ་དང་། མིག་མི་བཟང་དང་། ཡུལ་འཁོར་སྲུང་དང་། ལུས་ངན་པོ་རྣམས་ལ་བཀའ་སྩལ་པ།
en: Now the blessed, thus-gone Śākyamuni addressed Śakra, Brahmā , Virūḍhaka, Virūpākṣa, Dhṛtarāṣṭra, and Kubera:

source: བཞིན་བཟངས་དག་ང་སེམས་ཅན་ལ་སྙིང་རྗེའི་སྨོན་ལམ་གྱིས་ཉོན་མོངས་པ་ཅན་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་ཆོས་ཀྱི་མུ་གེ་བྱུང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། སེམས་ཅན་མ་རིག་པའི་མུན་པར་ཞུགས་པ།
en: “O sublime beings, I have fully realized unsurpassed and perfect awakening in this buddha field, which is afflicted by the five degenerations and lacking in Dharma, through my compassionate dedication to sentient beings.

source: ཉོན་མོངས་པའི་ཆོམ་རྐུན་དང་། གཡོན་ཅན་གྱིས་གཙེས་པ་རྣམས་ཀྱི་ཉོན་མོངས་པ་རབ་ཏུ་ཞི་བར་བྱ་བའི་ཕྱིར། ངས་བདུད་ཀྱི་ཕྱོགས་ནི་ཕམ་པར་བྱས། དམ་པའི་ཆོས་ཀྱི་རྒྱལ་མཚན་ནི་བསྒྲེང་། སེམས་ཅན་ཚད་མེད་པ་དག་ནི་སྡུག་བསྔལ་རྣམས་ལས་ཡོངས་སུ་ཐར་བར་བྱས། དམ་པའི་ཆོས་ཀྱི་ཆར་ནི་ཕབ། ངས་བདུད་བྱེ་བ་ནི་ཕམ་པར་བྱས་སོ།
en: In order to quell the pain of beings thrown into the darkness of ignorance and overwhelmed by the thieves and rogues of the afflictions, I have conquered the faction of Māra , raised the banner of the sacred Dharma, delivered countless beings from suffering, rained showers of the sacred Dharma, and defeated ten million māras.

source: །བཞིན་བཟངས་དག་གང་གི་ཕྱིར་ད་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བགྲང་བ་ལས་འདས་པ་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་གི་སའི་བཅུད་དང་། སེམས་ཅན་གྱི་གནས་ཀྱི་ཉེས་པ་རྣམས་རབ་ཏུ་ཞི་བར་བྱ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། མི་དགེ་བའི་ལས་ཐམས་ཅད་མ་ལུས་པར་ཟད་པར་བྱ་བ་དང་། དཀོན་མཆོག་གསུམ་གྱི་རིགས་ཡུན་རིང་དུ་གནས་པར་བྱ་བ་ནས།
en: “O sublime beings, this Dharma discourse and exposition of the dhāraṇī-seal, including its verbal formula, which is called the terminator of birth based on the essential nature of phenomena in their vajra-like indivisibility, has been consecrated by infinite numbers of blessed buddhas and bodhisattva great beings, impossible to count, who have gathered from the world spheres in the ten directions; it has been consecrated by them to pacify the negativities of beings in this buddha field who depend for life on the earth’s vitality to bring them to maturity, to exhaust all their negative action, to ensure the long continuity of the lineage of the Three Jewels, . . .

source: སངས་རྒྱས་ཀྱི་དགོངས་པ་མཐའ་དག་ཡོངས་སུ་གྲུབ་པར་བྱ་བའི་བར་གྱི་ཕྱིར། ཆོས་མཉམ་པ་ཉིད་རྡོ་རྗེ་ལྟ་བུ་བརྟེན་པའི་ཆོས་ཀྱི་སྙིང་པོས་ལུས་འཇོམས་པ་ཞེས་བྱ་བའི་གཟུངས་ཕྱག་རྒྱ་དང་། ཚིག་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པ།
en: and to completely fulfill all the buddhas’ intentions.

source: ལུང་བསྟན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྱིན་གྱིས་བརླབས་ཀྱིས་དེ་བཞིན་དུ་ཁྱེད་ཀྱིས་ཀྱང་བྱིན་གྱིས་རློབས་ལ་སྲུངས་ཤིག །གང་ངའི་དམ་པའི་ཆོས་ཀྱི་ཚུལ་ཡང་དག་པར་བསྲུང་བའི་དགེ་བའི་རྩ་བས་བསོད་ནམས་མངོན་པར་འདུ་བྱེད་པའི་ཚོགས་དང་། གང་ལུང་འབོགས་པ་དང་། ཁ་ཏོན་བྱེད་པ་དང་། དྲན་པ་དང་། བརྗོད་པ་དང་། བཤད་པ་དང་། དཀོན་མཆོག་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་དང་། དགེ་བསྙེན་གྱི་སྡོམ་པ་དང་། ཚངས་པར་སྤྱོད་པ་ལ་གནས་པའི་དགེ་བའི་རྩ་བས་བསོད་ནམས་མངོན་པར་འདུ་བྱེད་པའི་ཚོགས་དང་། གང་བསམ་གཏན་དང་པོ་བསྒོམ་པ་ནས་འདུ་ཤེས་དང་ཚོར་བ་འགོག་པ་བསྒོམ་པའི་བར་དང་། གང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་དུ་བྱ་བ་ནས་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་མངོན་པར་འདུ་བྱ་བའི་བར་གྱི་བསོད་ནམས་ཀྱི་ཚོགས་དང་། གང་ཡང་དེ་འདྲ་བའི་བསོད་ནམས་ཀྱི་ཚོགས་ཀྱི་དགེ་བའི་རྩ་བ་མངོན་པར་འདུ་བྱ་བ་ད་ལྟ་ན་བྱེད་པ་དང་། མ་འོངས་པའི་དུས་ན་བྱེད་པར་འགྱུར་བ་ནས། ངའི་དམ་པའི་ཆོས་ཀྱི་སྒྲོན་མ་འདི་འབར་བར་འགྱུར་བའི་བར་དུ་བསོད་ནམས་མངོན་པར་འདུ་བྱ་བའི་ཚོགས་དེ་དག་ཐམས་ཅད་ཁྱེད་ཀྱི་ལག་ཏུ་གཏད་དོ།
en: So, too, you should bless it and protect it. “I entrust you with the responsibility for the formation of merit through the roots of virtue of anyone who protects this sacred Dharma method. Likewise, I entrust you with the responsibility for the formation of merit through the roots of virtue of anyone who imparts the scriptures or recites, memorizes, pronounces, or explains them, goes for refuge in the Three Jewels, maintains lay vows, or observes pure conduct. I also entrust you with the responsibility for the formation of merit in the process that begins with entry into the first concentration and continues until the cultivation of the cessation of perception and sensation, as well as the process that begins with actualizing the fruit of entering the stream and continues until actualizing the awakening of buddhahood. I entrust you with the responsibility for the formation of the roots of virtue of these kinds of accumulations of merit in the present and in the future, as well as the formation of merit that results from shining the lamp of the sacred Dharma.

source: །གང་དེ་བཞིན་གཤེགས་པས་ཐུགས་སུ་ཆུད་པའི་ཆོས་ཀྱི་ཚུལ་ཡང་དག་པར་འབར་བར་བྱེད་པར་བརྩོན་པ་དེ་དག་གིས་བསོད་ནམས་ཀྱི་ཚོགས་ཀྱང་ཁྱེད་ཀྱི་ལག་ཏུ་གཏད་དོ།
en: I entrust you with the responsibility for the formation of merit for anyone who strives to propagate the Dharma methods blessed by the thus-gone ones.

source: །མ་འོངས་པའི་དུས་ན། གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་ནས། ཐ་ན་གླེགས་བམ་ལ་བྲིས་ཏེ། འཆང་བའི་བར་དུ་བྱེད་པ་དེ་དག་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་འདིས་ལས་ཐམས་ཅད་བྱང་བར་འགྱུར་རོ།
en: Anyone in the future who retains, or even writes down, this Dharma in the form of a book and carries it will purify all karmic action through this Dharma discourse.

source: །གྲོགས་པོ་དག་གྲོང་ངམ་དམངས་ཀྱི་ཁྱིམ་གྱི་བར་དུ་གང་དང་གང་ན་ཆོས་སྨྲ་བ་ཤིན་ཏུ་ཁྲུས་བྱས་ཏེ། གོས་སར་པ་བགོས་ནས། མེ་ཏོག་བཀྲམ་པའི་འཁོར་གྱི་ཁྱམས་སུ། སྤོས་སྣ་ཚོགས་ཀྱིས་བདུགས་པ་རས་བཅོས་བུ་དང་། རས་སྣ་ཚོགས་བཏིང་བའི་སེང་གེའི་ཁྲི་ལ་འདུག་སྟེ། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྕེའི་རྩེ་མོས་འཆད་དམ། ཐ་ན་གླེགས་བམ་ལ་བྲིས་ཏེ། ཀློག་པ་དེར་གལ་ཏེ་ཁྱོད་ཆོས་ཉན་པ་དང་། ཆོས་སྨྲ་བ་བསྲུང་བའམ།
en: Friends, whether in a town, a home, or another place, should a Dharma preacher bathe, put on new garments, and sit on a lion throne strewn with various flowers, censed with fragrant incense, and covered with fine fabrics and linens to teach this Dharma discourse from the tip of his tongue, or even just write it down and recite it, will you care for the Dharma teacher and student?

source: ཆོས་ཉན་པ་རྣམས་ཡོངས་སུ་བསྐྱང་བའམ།
en: Will you protect the Dharma students?

source: བདག་དང་གཞན་དང་གཉི་ག་མི་དགེ་བའི་ལས་ཡོངས་སུ་ཟད་པར་བྱ་བའི་ཕྱིར་དེར་མ་དོང་ན་དེའི་ཕྱིར་ཁྱེད་ཀྱིས་བསླུས་པ་དང་། ལམ་བསྐྱེད་པ་ལ་རྨོངས་པ་བྱས་པར་འགྱུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ད་ལྟར་དང་མ་མཆིས་པའི་དུས་ན། དམ་པའི་ཆོས་ཀྱི་ཚུལ་གྱི་བར་དུ་ནུབ་པར་གྱུར་པ་ན། གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། ལྗོངས་སམ། རི་བྲགས་སམ། ཕོ་བྲང་འཁོར་ཏམ། གཙུག་ལག་ཁང་ངམ། དགོན་པའི་གནས་སམ། རྒྱལ་པོའི་ཕོ་བྲང་ངམ། བྲམ་ཟེའི་ཁྱིམ་འམ། ཚོང་དཔོན་གྱི་ཁྱིམ་འམ།
en: If you do not go there to exhaust the nonvirtue of both yourselves and others, you will have deceived us and will have become deluded with regard to the development of the path.”
